from aiogram.fsm.state import State, StatesGroup


class AddWord(StatesGroup):
    waiting_en = State()
    waiting_ru = State()
    waiting_many = State()


class Exercise(StatesGroup):
    waiting_count = State()
    waiting_type = State()   
    in_progress = State()


"""
FSM - конечный автомат. Система, которая в каждый момент 
находится ровно в одном состоянии из зарнее известного набора, 
и может переключаться между ними по опеределенным правилам
а ну типо, в светофоре, после красного всегда идет зеленый
после зеленого желтый и тд
цвет - состояния 
то куда может перейти - правило

т.е. в моем контексте благодаря состоянию, бот понимает
что именно вводит пользователь (новое слово, либо ответ на упражнение)

как работает в aiogram:
StatesGroup — это класс-контейнер, который группирует связанные состояния
State() - конкретное состоянии внутри группы
п.с. у State есть идентификатор (state - имя группы:состоянии, к примеру
AddWord:waiting_en)
и group? = StatesGroup (п.с. без наследования низя)
"""